redis_benchmark/test/withPolicy7_10000000.txt
====== GET ======
  10084328 requests completed in 6.00 seconds
  1000 parallel clients
  3 bytes payload
  keep alive: 1
  host configuration "save": 3600 1 300 100 60 10000
  host configuration "appendonly": no
  multi-thread: no

Latency by percentile distribution:
0.000% <= 26.991 milliseconds (cumulative count 1000)
50.000% <= 321.791 milliseconds (cumulative count 5010336)
75.000% <= 395.007 milliseconds (cumulative count 7503392)
87.500% <= 451.583 milliseconds (cumulative count 8750000)
93.750% <= 492.287 milliseconds (cumulative count 9378000)
96.875% <= 521.471 milliseconds (cumulative count 9688000)
98.438% <= 529.407 milliseconds (cumulative count 9849000)
99.219% <= 532.479 milliseconds (cumulative count 9923000)
99.609% <= 534.527 milliseconds (cumulative count 9965000)
99.805% <= 535.551 milliseconds (cumulative count 9982000)
99.902% <= 536.575 milliseconds (cumulative count 9997000)
99.976% <= 537.087 milliseconds (cumulative count 10000000)
100.000% <= 537.087 milliseconds (cumulative count 10000000)

Cumulative distribution of latencies:
0.000% <= 0.103 milliseconds (cumulative count 0)
0.020% <= 27.103 milliseconds (cumulative count 2000)
0.180% <= 28.111 milliseconds (cumulative count 18000)
0.190% <= 29.103 milliseconds (cumulative count 19000)
0.230% <= 30.111 milliseconds (cumulative count 23000)
0.270% <= 31.103 milliseconds (cumulative count 27000)
0.290% <= 32.111 milliseconds (cumulative count 29000)
0.300% <= 33.119 milliseconds (cumulative count 30000)
0.320% <= 34.111 milliseconds (cumulative count 32000)
0.330% <= 35.103 milliseconds (cumulative count 33000)
0.340% <= 36.127 milliseconds (cumulative count 34000)
0.490% <= 72.127 milliseconds (cumulative count 49000)
0.640% <= 73.151 milliseconds (cumulative count 64000)
0.780% <= 74.111 milliseconds (cumulative count 78000)
0.940% <= 75.135 milliseconds (cumulative count 94000)
1.090% <= 76.159 milliseconds (cumulative count 109000)
1.120% <= 77.119 milliseconds (cumulative count 112000)
1.240% <= 81.151 milliseconds (cumulative count 124000)
1.370% <= 82.111 milliseconds (cumulative count 137000)
1.530% <= 83.135 milliseconds (cumulative count 153000)
1.680% <= 84.159 milliseconds (cumulative count 168000)
1.830% <= 85.119 milliseconds (cumulative count 183000)
1.990% <= 86.143 milliseconds (cumulative count 199000)
2.110% <= 87.103 milliseconds (cumulative count 211000)
2.190% <= 90.111 milliseconds (cumulative count 219000)
2.350% <= 91.135 milliseconds (cumulative count 235000)
2.480% <= 92.159 milliseconds (cumulative count 248000)
2.620% <= 93.119 milliseconds (cumulative count 262000)
2.770% <= 94.143 milliseconds (cumulative count 277000)
2.810% <= 121.151 milliseconds (cumulative count 281000)
2.890% <= 126.143 milliseconds (cumulative count 289000)
3.030% <= 127.103 milliseconds (cumulative count 303000)
3.160% <= 128.127 milliseconds (cumulative count 316000)
3.300% <= 129.151 milliseconds (cumulative count 330000)
3.340% <= 130.111 milliseconds (cumulative count 334000)
3.420% <= 131.199 milliseconds (cumulative count 342000)
3.550% <= 132.223 milliseconds (cumulative count 355000)
3.570% <= 133.119 milliseconds (cumulative count 357000)
3.670% <= 141.183 milliseconds (cumulative count 367000)
3.790% <= 142.207 milliseconds (cumulative count 379000)
3.920% <= 143.103 milliseconds (cumulative count 392000)
3.970% <= 144.127 milliseconds (cumulative count 397000)
4.040% <= 145.151 milliseconds (cumulative count 404000)
4.180% <= 146.175 milliseconds (cumulative count 418000)
4.330% <= 147.199 milliseconds (cumulative count 433000)
4.410% <= 148.223 milliseconds (cumulative count 441000)
4.430% <= 152.191 milliseconds (cumulative count 443000)
4.570% <= 153.215 milliseconds (cumulative count 457000)
4.690% <= 154.111 milliseconds (cumulative count 469000)
4.750% <= 155.135 milliseconds (cumulative count 475000)
4.760% <= 170.111 milliseconds (cumulative count 476000)
4.790% <= 171.135 milliseconds (cumulative count 479000)
4.830% <= 172.159 milliseconds (cumulative count 483000)
4.860% <= 173.183 milliseconds (cumulative count 486000)
4.880% <= 174.207 milliseconds (cumulative count 488000)
4.910% <= 179.199 milliseconds (cumulative count 491000)
4.930% <= 180.223 milliseconds (cumulative count 493000)
4.960% <= 181.119 milliseconds (cumulative count 496000)
4.990% <= 182.143 milliseconds (cumulative count 499000)
5.020% <= 183.167 milliseconds (cumulative count 502000)
5.050% <= 184.191 milliseconds (cumulative count 505000)
5.080% <= 185.215 milliseconds (cumulative count 508000)
5.090% <= 186.111 milliseconds (cumulative count 509000)
5.100% <= 189.183 milliseconds (cumulative count 510000)
5.130% <= 190.207 milliseconds (cumulative count 513000)
5.150% <= 191.103 milliseconds (cumulative count 515000)
5.180% <= 192.127 milliseconds (cumulative count 518000)
5.210% <= 193.151 milliseconds (cumulative count 521000)
5.240% <= 194.175 milliseconds (cumulative count 524000)
5.270% <= 200.191 milliseconds (cumulative count 527000)
5.280% <= 202.111 milliseconds (cumulative count 528000)
5.310% <= 203.135 milliseconds (cumulative count 531000)
5.320% <= 204.159 milliseconds (cumulative count 532000)
5.360% <= 205.183 milliseconds (cumulative count 536000)
5.390% <= 206.207 milliseconds (cumulative count 539000)
5.430% <= 218.111 milliseconds (cumulative count 543000)
5.510% <= 220.159 milliseconds (cumulative count 551000)
5.660% <= 221.183 milliseconds (cumulative count 566000)
5.800% <= 222.207 milliseconds (cumulative count 580000)
5.920% <= 223.103 milliseconds (cumulative count 592000)
6.040% <= 224.127 milliseconds (cumulative count 604000)
6.180% <= 225.151 milliseconds (cumulative count 618000)
6.320% <= 226.175 milliseconds (cumulative count 632000)
6.450% <= 227.199 milliseconds (cumulative count 645000)
6.660% <= 228.223 milliseconds (cumulative count 666000)
6.900% <= 229.119 milliseconds (cumulative count 690000)
7.170% <= 230.143 milliseconds (cumulative count 717000)
7.460% <= 231.167 milliseconds (cumulative count 746000)
7.630% <= 232.191 milliseconds (cumulative count 763000)
7.810% <= 233.215 milliseconds (cumulative count 781000)
7.830% <= 235.135 milliseconds (cumulative count 783000)
8.004% <= 236.159 milliseconds (cumulative count 800408)
8.342% <= 237.183 milliseconds (cumulative count 834224)
8.577% <= 238.207 milliseconds (cumulative count 857744)
8.801% <= 239.103 milliseconds (cumulative count 880128)
9.101% <= 240.127 milliseconds (cumulative count 910128)
9.471% <= 241.151 milliseconds (cumulative count 947128)
9.927% <= 242.175 milliseconds (cumulative count 992672)
10.302% <= 243.199 milliseconds (cumulative count 1030192)
10.727% <= 244.223 milliseconds (cumulative count 1072712)
11.031% <= 245.119 milliseconds (cumulative count 1103096)
11.311% <= 246.143 milliseconds (cumulative count 1131096)
11.331% <= 247.167 milliseconds (cumulative count 1133096)
11.521% <= 248.191 milliseconds (cumulative count 1152096)
11.627% <= 249.215 milliseconds (cumulative count 1162664)
11.730% <= 250.111 milliseconds (cumulative count 1173048)
12.276% <= 251.135 milliseconds (cumulative count 1227568)
12.861% <= 252.159 milliseconds (cumulative count 1286088)
13.456% <= 253.183 milliseconds (cumulative count 1345608)
14.061% <= 254.207 milliseconds (cumulative count 1406128)
14.674% <= 255.103 milliseconds (cumulative count 1467376)
15.414% <= 256.127 milliseconds (cumulative count 1541376)
15.984% <= 257.151 milliseconds (cumulative count 1598376)
16.404% <= 258.175 milliseconds (cumulative count 1640376)
16.995% <= 259.199 milliseconds (cumulative count 1699488)
17.733% <= 260.223 milliseconds (cumulative count 1773328)
18.103% <= 261.119 milliseconds (cumulative count 1810328)
18.733% <= 262.143 milliseconds (cumulative count 1873328)
19.373% <= 263.167 milliseconds (cumulative count 1937328)
19.963% <= 264.191 milliseconds (cumulative count 1996328)
20.623% <= 265.215 milliseconds (cumulative count 2062328)
21.273% <= 266.239 milliseconds (cumulative count 2127328)
21.803% <= 267.263 milliseconds (cumulative count 2180328)
22.355% <= 268.287 milliseconds (cumulative count 2235464)
23.120% <= 269.311 milliseconds (cumulative count 2311984)
23.839% <= 270.335 milliseconds (cumulative count 2383936)
24.208% <= 271.103 milliseconds (cumulative count 2420752)
24.817% <= 272.127 milliseconds (cumulative count 2481704)
25.434% <= 273.151 milliseconds (cumulative count 2543384)
26.054% <= 274.175 milliseconds (cumulative count 2605384)
26.696% <= 275.199 milliseconds (cumulative count 2669632)
27.083% <= 276.223 milliseconds (cumulative count 2708336)
27.283% <= 277.247 milliseconds (cumulative count 2728336)
27.493% <= 278.271 milliseconds (cumulative count 2749336)
27.883% <= 279.295 milliseconds (cumulative count 2788336)
28.373% <= 280.319 milliseconds (cumulative count 2837336)
28.773% <= 281.343 milliseconds (cumulative count 2877336)
28.943% <= 282.111 milliseconds (cumulative count 2894336)
29.313% <= 283.135 milliseconds (cumulative count 2931336)
29.663% <= 284.159 milliseconds (cumulative count 2966336)
29.953% <= 285.183 milliseconds (cumulative count 2995336)
30.103% <= 286.207 milliseconds (cumulative count 3010336)
30.443% <= 287.231 milliseconds (cumulative count 3044336)
30.833% <= 288.255 milliseconds (cumulative count 3083336)
31.453% <= 289.279 milliseconds (cumulative count 3145336)
32.103% <= 290.303 milliseconds (cumulative count 3210336)
32.613% <= 291.327 milliseconds (cumulative count 3261336)
33.113% <= 292.351 milliseconds (cumulative count 3311336)
33.513% <= 293.119 milliseconds (cumulative count 3351336)
34.103% <= 294.143 milliseconds (cumulative count 3410336)
34.563% <= 295.167 milliseconds (cumulative count 3456336)
35.013% <= 296.191 milliseconds (cumulative count 3501336)
35.403% <= 297.215 milliseconds (cumulative count 3540336)
35.973% <= 298.239 milliseconds (cumulative count 3597336)
36.633% <= 299.263 milliseconds (cumulative count 3663336)
37.323% <= 300.287 milliseconds (cumulative count 3732336)
37.783% <= 301.311 milliseconds (cumulative count 3778336)
38.243% <= 302.335 milliseconds (cumulative count 3824336)
38.633% <= 303.103 milliseconds (cumulative count 3863336)
39.113% <= 304.127 milliseconds (cumulative count 3911336)
39.523% <= 305.151 milliseconds (cumulative count 3952336)
39.993% <= 306.175 milliseconds (cumulative count 3999336)
40.563% <= 307.199 milliseconds (cumulative count 4056336)
41.213% <= 308.223 milliseconds (cumulative count 4121336)
42.263% <= 309.247 milliseconds (cumulative count 4226336)
43.123% <= 310.271 milliseconds (cumulative count 4312336)
43.953% <= 311.295 milliseconds (cumulative count 4395336)
44.823% <= 312.319 milliseconds (cumulative count 4482336)
45.613% <= 313.343 milliseconds (cumulative count 4561336)
46.083% <= 314.111 milliseconds (cumulative count 4608336)
46.543% <= 315.135 milliseconds (cumulative count 4654336)
46.803% <= 316.159 milliseconds (cumulative count 4680336)
46.963% <= 317.183 milliseconds (cumulative count 4696336)
47.443% <= 318.207 milliseconds (cumulative count 4744336)
48.143% <= 319.231 milliseconds (cumulative count 4814336)
48.923% <= 320.255 milliseconds (cumulative count 4892336)
49.693% <= 321.279 milliseconds (cumulative count 4969336)
50.453% <= 322.303 milliseconds (cumulative count 5045336)
51.323% <= 323.327 milliseconds (cumulative count 5132336)
52.123% <= 324.351 milliseconds (cumulative count 5212336)
52.513% <= 325.119 milliseconds (cumulative count 5251336)
52.943% <= 326.143 milliseconds (cumulative count 5294336)
53.663% <= 327.167 milliseconds (cumulative count 5366336)
54.373% <= 328.191 milliseconds (cumulative count 5437336)
55.303% <= 329.215 milliseconds (cumulative count 5530336)
55.953% <= 330.239 milliseconds (cumulative count 5595336)
56.763% <= 331.263 milliseconds (cumulative count 5676336)
57.373% <= 332.287 milliseconds (cumulative count 5737336)
58.073% <= 333.311 milliseconds (cumulative count 5807336)
58.763% <= 334.335 milliseconds (cumulative count 5876336)
59.223% <= 335.103 milliseconds (cumulative count 5922336)
59.743% <= 336.127 milliseconds (cumulative count 5974336)
59.993% <= 337.151 milliseconds (cumulative count 5999336)
60.393% <= 338.175 milliseconds (cumulative count 6039336)
60.723% <= 339.199 milliseconds (cumulative count 6072336)
61.203% <= 340.223 milliseconds (cumulative count 6120336)
61.733% <= 341.247 milliseconds (cumulative count 6173336)
62.233% <= 342.271 milliseconds (cumulative count 6223336)
62.683% <= 343.295 milliseconds (cumulative count 6268336)
63.073% <= 344.319 milliseconds (cumulative count 6307336)
63.643% <= 345.343 milliseconds (cumulative count 6364336)
64.033% <= 346.111 milliseconds (cumulative count 6403336)
64.493% <= 347.135 milliseconds (cumulative count 6449336)
64.903% <= 348.159 milliseconds (cumulative count 6490336)
65.323% <= 349.183 milliseconds (cumulative count 6532336)
65.643% <= 350.207 milliseconds (cumulative count 6564336)
65.933% <= 351.231 milliseconds (cumulative count 6593336)
66.183% <= 352.255 milliseconds (cumulative count 6618336)
66.473% <= 353.279 milliseconds (cumulative count 6647336)
66.613% <= 354.303 milliseconds (cumulative count 6661336)
66.813% <= 355.327 milliseconds (cumulative count 6681336)
67.053% <= 356.351 milliseconds (cumulative count 6705336)
67.163% <= 357.119 milliseconds (cumulative count 6716336)
67.313% <= 358.143 milliseconds (cumulative count 6731336)
67.453% <= 359.167 milliseconds (cumulative count 6745336)
67.743% <= 360.191 milliseconds (cumulative count 6774336)
68.013% <= 361.215 milliseconds (cumulative count 6801336)
68.203% <= 362.239 milliseconds (cumulative count 6820336)
68.423% <= 363.263 milliseconds (cumulative count 6842336)
68.723% <= 364.287 milliseconds (cumulative count 6872336)
69.003% <= 365.311 milliseconds (cumulative count 6900336)
69.293% <= 366.335 milliseconds (cumulative count 6929336)
69.403% <= 367.103 milliseconds (cumulative count 6940336)
69.623% <= 368.127 milliseconds (cumulative count 6962336)
69.773% <= 369.151 milliseconds (cumulative count 6977336)
69.913% <= 370.175 milliseconds (cumulative count 6991336)
70.053% <= 371.199 milliseconds (cumulative count 7005336)
70.313% <= 373.247 milliseconds (cumulative count 7031336)
70.573% <= 374.271 milliseconds (cumulative count 7057336)
70.783% <= 375.295 milliseconds (cumulative count 7078336)
70.973% <= 376.319 milliseconds (cumulative count 7097336)
71.123% <= 377.343 milliseconds (cumulative count 7112336)
71.263% <= 378.111 milliseconds (cumulative count 7126336)
71.433% <= 379.135 milliseconds (cumulative count 7143336)
71.573% <= 380.159 milliseconds (cumulative count 7157336)
71.723% <= 381.183 milliseconds (cumulative count 7172336)
71.853% <= 382.207 milliseconds (cumulative count 7185336)
72.003% <= 383.231 milliseconds (cumulative count 7200336)
72.213% <= 384.255 milliseconds (cumulative count 7221336)
72.553% <= 385.279 milliseconds (cumulative count 7255336)
72.874% <= 386.303 milliseconds (cumulative count 7287384)
73.233% <= 387.327 milliseconds (cumulative count 7323336)
73.479% <= 388.351 milliseconds (cumulative count 7347856)
73.745% <= 389.119 milliseconds (cumulative count 7374536)
73.955% <= 390.143 milliseconds (cumulative count 7395536)
74.228% <= 391.167 milliseconds (cumulative count 7422784)
74.553% <= 392.191 milliseconds (cumulative count 7455304)
74.833% <= 393.215 milliseconds (cumulative count 7483256)
74.914% <= 394.239 milliseconds (cumulative count 7491392)
75.070% <= 395.263 milliseconds (cumulative count 7506960)
75.179% <= 396.287 milliseconds (cumulative count 7517912)
75.246% <= 397.311 milliseconds (cumulative count 7524592)
75.471% <= 398.335 milliseconds (cumulative count 7547112)
75.588% <= 399.103 milliseconds (cumulative count 7558816)
75.846% <= 400.127 milliseconds (cumulative count 7584632)
76.062% <= 401.151 milliseconds (cumulative count 7606152)
76.151% <= 402.175 milliseconds (cumulative count 7615104)
76.319% <= 403.199 milliseconds (cumulative count 7631920)
76.469% <= 404.223 milliseconds (cumulative count 7646920)
76.747% <= 405.247 milliseconds (cumulative count 7674736)
76.944% <= 406.271 milliseconds (cumulative count 7694416)
77.288% <= 407.295 milliseconds (cumulative count 7728800)
77.395% <= 408.319 milliseconds (cumulative count 7739480)
77.592% <= 409.343 milliseconds (cumulative count 7759184)
77.829% <= 410.111 milliseconds (cumulative count 7782888)
78.077% <= 411.135 milliseconds (cumulative count 7807704)
78.527% <= 412.159 milliseconds (cumulative count 7852656)
79.016% <= 413.183 milliseconds (cumulative count 7901608)
79.364% <= 414.207 milliseconds (cumulative count 7936424)
79.792% <= 415.231 milliseconds (cumulative count 7979240)
80.006% <= 416.255 milliseconds (cumulative count 8000648)
80.196% <= 417.279 milliseconds (cumulative count 8019648)
80.413% <= 418.303 milliseconds (cumulative count 8041328)
80.943% <= 419.327 milliseconds (cumulative count 8094280)
81.332% <= 420.351 milliseconds (cumulative count 8133232)
81.653% <= 421.119 milliseconds (cumulative count 8165344)
82.049% <= 422.143 milliseconds (cumulative count 8204864)
82.300% <= 423.167 milliseconds (cumulative count 8230000)
82.510% <= 424.191 milliseconds (cumulative count 8251000)
82.720% <= 425.215 milliseconds (cumulative count 8272000)
82.940% <= 426.239 milliseconds (cumulative count 8294000)
83.200% <= 427.263 milliseconds (cumulative count 8320000)
83.530% <= 428.287 milliseconds (cumulative count 8353000)
83.690% <= 429.311 milliseconds (cumulative count 8369000)
83.760% <= 430.335 milliseconds (cumulative count 8376000)
83.870% <= 431.103 milliseconds (cumulative count 8387000)
83.990% <= 432.127 milliseconds (cumulative count 8399000)
84.110% <= 433.151 milliseconds (cumulative count 8411000)
84.230% <= 434.175 milliseconds (cumulative count 8423000)
84.350% <= 435.199 milliseconds (cumulative count 8435000)
84.520% <= 436.223 milliseconds (cumulative count 8452000)
84.730% <= 437.247 milliseconds (cumulative count 8473000)
84.830% <= 438.271 milliseconds (cumulative count 8483000)
84.850% <= 439.295 milliseconds (cumulative count 8485000)
84.880% <= 440.319 milliseconds (cumulative count 8488000)
85.030% <= 441.343 milliseconds (cumulative count 8503000)
85.240% <= 442.111 milliseconds (cumulative count 8524000)
85.590% <= 443.135 milliseconds (cumulative count 8559000)
85.900% <= 444.159 milliseconds (cumulative count 8590000)
86.250% <= 445.183 milliseconds (cumulative count 8625000)
86.490% <= 446.207 milliseconds (cumulative count 8649000)
86.580% <= 447.231 milliseconds (cumulative count 8658000)
86.720% <= 448.255 milliseconds (cumulative count 8672000)
86.940% <= 449.279 milliseconds (cumulative count 8694000)
87.060% <= 450.303 milliseconds (cumulative count 8706000)
87.400% <= 451.327 milliseconds (cumulative count 8740000)
87.820% <= 452.351 milliseconds (cumulative count 8782000)
88.140% <= 453.119 milliseconds (cumulative count 8814000)
88.430% <= 454.143 milliseconds (cumulative count 8843000)
88.650% <= 455.167 milliseconds (cumulative count 8865000)
88.990% <= 456.191 milliseconds (cumulative count 8899000)
89.370% <= 457.215 milliseconds (cumulative count 8937000)
89.670% <= 458.239 milliseconds (cumulative count 8967000)
89.990% <= 459.263 milliseconds (cumulative count 8999000)
90.230% <= 460.287 milliseconds (cumulative count 9023000)
90.350% <= 461.311 milliseconds (cumulative count 9035000)
90.490% <= 462.335 milliseconds (cumulative count 9049000)
90.590% <= 463.103 milliseconds (cumulative count 9059000)
90.750% <= 464.127 milliseconds (cumulative count 9075000)
90.890% <= 465.151 milliseconds (cumulative count 9089000)
91.020% <= 466.175 milliseconds (cumulative count 9102000)
91.210% <= 467.199 milliseconds (cumulative count 9121000)
91.400% <= 468.223 milliseconds (cumulative count 9140000)
91.690% <= 469.247 milliseconds (cumulative count 9169000)
91.890% <= 470.271 milliseconds (cumulative count 9189000)
91.980% <= 471.295 milliseconds (cumulative count 9198000)
92.010% <= 472.319 milliseconds (cumulative count 9201000)
92.150% <= 473.343 milliseconds (cumulative count 9215000)
92.250% <= 474.111 milliseconds (cumulative count 9225000)
92.380% <= 475.135 milliseconds (cumulative count 9238000)
92.500% <= 476.159 milliseconds (cumulative count 9250000)
92.580% <= 477.183 milliseconds (cumulative count 9258000)
92.720% <= 478.207 milliseconds (cumulative count 9272000)
92.860% <= 479.231 milliseconds (cumulative count 9286000)
92.940% <= 480.255 milliseconds (cumulative count 9294000)
93.070% <= 487.167 milliseconds (cumulative count 9307000)
93.210% <= 488.191 milliseconds (cumulative count 9321000)
93.350% <= 489.215 milliseconds (cumulative count 9335000)
93.490% <= 490.239 milliseconds (cumulative count 9349000)
93.640% <= 491.263 milliseconds (cumulative count 9364000)
93.780% <= 492.287 milliseconds (cumulative count 9378000)
93.920% <= 493.311 milliseconds (cumulative count 9392000)
94.060% <= 494.335 milliseconds (cumulative count 9406000)
94.170% <= 495.103 milliseconds (cumulative count 9417000)
94.180% <= 500.223 milliseconds (cumulative count 9418000)
94.320% <= 501.247 milliseconds (cumulative count 9432000)
94.470% <= 502.271 milliseconds (cumulative count 9447000)
94.640% <= 503.295 milliseconds (cumulative count 9464000)
94.790% <= 504.319 milliseconds (cumulative count 9479000)
94.880% <= 505.343 milliseconds (cumulative count 9488000)
94.960% <= 507.135 milliseconds (cumulative count 9496000)
95.110% <= 508.159 milliseconds (cumulative count 9511000)
95.330% <= 509.183 milliseconds (cumulative count 9533000)
95.520% <= 510.207 milliseconds (cumulative count 9552000)
95.620% <= 511.231 milliseconds (cumulative count 9562000)
95.710% <= 513.279 milliseconds (cumulative count 9571000)
95.950% <= 514.303 milliseconds (cumulative count 9595000)
96.140% <= 515.327 milliseconds (cumulative count 9614000)
96.230% <= 516.351 milliseconds (cumulative count 9623000)
96.270% <= 517.119 milliseconds (cumulative count 9627000)
96.410% <= 518.143 milliseconds (cumulative count 9641000)
96.550% <= 519.167 milliseconds (cumulative count 9655000)
96.680% <= 520.191 milliseconds (cumulative count 9668000)
96.840% <= 521.215 milliseconds (cumulative count 9684000)
97.070% <= 522.239 milliseconds (cumulative count 9707000)
97.350% <= 523.263 milliseconds (cumulative count 9735000)
97.650% <= 524.287 milliseconds (cumulative count 9765000)
97.790% <= 525.311 milliseconds (cumulative count 9779000)
97.870% <= 526.335 milliseconds (cumulative count 9787000)
97.980% <= 527.359 milliseconds (cumulative count 9798000)
98.250% <= 528.383 milliseconds (cumulative count 9825000)
98.490% <= 529.407 milliseconds (cumulative count 9849000)
98.740% <= 530.431 milliseconds (cumulative count 9874000)
99.010% <= 531.455 milliseconds (cumulative count 9901000)
99.230% <= 532.479 milliseconds (cumulative count 9923000)
99.490% <= 533.503 milliseconds (cumulative count 9949000)
99.650% <= 534.527 milliseconds (cumulative count 9965000)
99.820% <= 535.551 milliseconds (cumulative count 9982000)
99.970% <= 536.575 milliseconds (cumulative count 9997000)
100.000% <= 537.599 milliseconds (cumulative count 10000000)

Summary:
  throughput summary: 1681562.00 requests per second
  latency summary (msec):
          avg       min       p50       p95       p99       max
      332.109    26.976   321.791   507.391   531.455   537.087